#include <Arduino.h>
#include "grey.h"

 uint8_t x1,x2,x3,x4,x5,x6,x7,x8;
 int err = 0; // 偏差值
void I2Cdata() 
{
  byte data = 0; // 用于存储读取的数据
  char bufbuf[50]={'\0'};
  Wire.beginTransmission(0x12); // I2C设备的地址
  Wire.write(0x30); // 寄存器地址
  Wire.endTransmission();
 
  delay(10); // 给设备足够的时间来处理请求
 
  Wire.requestFrom(0x12, 1); // 请求1个字节的数据
  while (Wire.available()) {
    data = Wire.read(); // 读取数据
  }

  x1 = (data>>7)&0x01;
  x2 = (data>>6)&0x01;
  x3 = (data>>5)&0x01;
  x4 = (data>>4)&0x01;
  x5 = (data>>3)&0x01;
  x6 = (data>>2)&0x01;
  x7 = (data>>1)&0x01;
  x8 = (data>>0)&0x01;

  sprintf(bufbuf,"x1:%d,x2:%d,x3:%d,x4:%d,x5:%d,x6:%d,x7:%d,x8:%d\r\n",x1,x2,x3,x4,x5,x6,x7,x8);
  Serial.println(bufbuf);
 
//  Serial.println(data, HEX); // 在串行监视器上打印数据（十六进制）
}
// 计算位置偏差
void LineWalking(void)
{
	if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 0 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 1110 1111
	{
		err = -1;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 0 && x4 == 0 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 1100 1111
	{
		err = -2;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 0 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 1101 1111
	{
		err = -2;
	}

	else if (x1 == 1 && x2 == 0 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 1011 1111
	{
		err = -3;
	}
	else if (x1 == 1 && x2 == 0 && x3 == 0 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 1001 1111
	{
		err = -3;
	}
	else if (x1 == 0 && x2 == 0 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 0011 1111
	{
		err = -4;
	}
	else if (x1 == 0 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 0111 1111
	{
		err = -4;
	}

	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 0 && x6 == 1 && x7 == 1 && x8 == 1) // 1111 0111
	{
		err = 1;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 0 && x6 == 0 && x7 == 1 && x8 == 1) // 1111 0011
	{
		err = 2;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 0 && x7 == 1 && x8 == 1) // 1111 1011
	{
		err = 2;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 0 && x7 == 0 && x8 == 1) // 1111 1001
	{
		err = 3;
	}

	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 0 && x8 == 1) // 1111 1101
	{
		err = 3;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 0 && x8 == 0) // 1111 1100
	{
		err = 4;
	}
	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 0) // 1111 1110
	{
		err = 4;
	}

	else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 0 && x5 == 0 && x6 == 1 && x7 == 1 && x8 == 1) // 直走  1110 0111
	{
		err = 0;
	}
    else if (x1 == 1 && x2 == 1 && x3 == 1 && x4 == 1 && x5 == 1 && x6 == 1 && x7 == 1 && x8 == 1) // 停止  1111 1111
    {
        err = 5;
    }
    
	// 剩下的就保持上一个状态
}